---------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Data\Expect\WE\Revision_final\ForPublication\tables_1_2_3.log
  log type:  text
 opened on:  29 Apr 2016, 11:30:12

. /***************************************************************************************************/
. 
. 
. /****************************************************************************************************/
. /******                                                                         For table1                         
>                                                      *****/
. /****************************************************************************************************/
. u WE_Data0

. /*The data set contains household identifiers, year of survey and 
> the responses to the expectation questions from the SHIW for 2008 and for 2010*/
. 
. /*Response to expectation question for stock prices*/
. preserve

. drop if anno==2010
(4135 observations deleted)

. drop if probors2>=probors1 & probors2!=.
(511 observations deleted)

. 
. count
 7466

. count if probors1==0
  797

. count if probors1>0 & probors1<=25
 1237

. count if probors1>25 & probors1<=50
  571

. count if probors1>50 & probors1<=75
  138

. count if probors1>75 & probors1<=100
   81

. count if probors1==.
 4642

. 
. drop if probors1==.
(4642 observations deleted)

. drop if probors1==0
(797 observations deleted)

. 
. count
 2027

. count if probors2==0
  587

. count if probors2>0 & probors2<=25
  977

. count if probors2>25 & probors2<=50
  143

. count if probors2>50 & probors2<=75
   22

. count if probors2>75 & probors2<=100
    5

. count if probors2==.
  293

. 
. restore

. 
. /*Response to expectation questions for interest rate*/
. 
. preserve

. drop if anno==2010
(4135 observations deleted)

. drop if probint2>=probint1 & probint2!=.
(1180 observations deleted)

. 
. count
 6797

. count if probint1==0
  633

. count if probint1>0 & probint1<=25
  751

. count if probint1>25 & probint1<=50
  549

. count if probint1>50 & probint1<=75
  184

. count if probint1>75 & probint1<=100
  200

. count if probint1==.
 4480

. 
. drop if probint1==.
(4480 observations deleted)

. drop if probint1==0
(633 observations deleted)

. 
. count if probint2==0
  199

. count if probint2>0 & probint2<=25
  711

. count if probint2>25 & probint2<=50
  253

. count if probint2>50 & probint2<=75
   50

. count if probint2>75 & probint2<=100
   12

. count if probint2==.
  459

. count if probint2==.
  459

. count
 1684

. 
. restore

. 
. /*Response to expectation questions for housing prices*/
. 
. preserve

. drop if anno==2008
(7977 observations deleted)

. drop if pcas2>=pcas1 & pcas2!=.
(475 observations deleted)

. 
. count
 3660

. count if pcas1==0
  847

. count if pcas1>0 & pcas1<=25
  674

. count if pcas1>25 & pcas1<=50
  324

. count if pcas1>50 & pcas1<=75
   91

. count if pcas1>75 & pcas1<=100
   71

. count if pcas1==.
 1653

. 
. drop if pcas1==.
(1653 observations deleted)

. drop if pcas1==0
(847 observations deleted)

. 
. count if pcas2==0
  345

. count if pcas2>0 & pcas2<=25
  510

. count if pcas2>25 & pcas2<=50
   97

. count if pcas2>50 & pcas2<=75
   12

. count if pcas2>75 & pcas2<=100
    7

. count if pcas2==.
  189

. count if pcas2==.
  189

. count
 1160

. 
. restore

. clear all

. /***************************************************************************************************/
. 
. 
. 
. /****************************************************************************************************/
. /******                                                                         For table2                         
>                                                      *****/
. /****************************************************************************************************/
. 
. #delimit;
delimiter now ;
. u WE_Data1;

. replace mu_R=mu_R-1;
(1734 real changes made)

.                         /*Net returns because the instruments are net returns*/
> replace mu_rbnd=mu_rbnd-1;
(1225 real changes made)

. replace mu_rf=mu_rf-1;
(1225 real changes made)

. /*Drop ouliers (1%)*/
> replace mu_R=. if mu_R<=-0.75 /*| mu_R>.15*/;
(31 real changes made, 31 to missing)

. replace mu_rf=. if mu_rf<=-0.04 /*| mu_rf>=0.044*/;
(23 real changes made, 23 to missing)

. replace mu_rbnd=. if mu_rbnd<=0 | mu_rbnd>=0.10;
(21 real changes made, 21 to missing)

. gen Dexp1=mu_R!=.;

.  replace Dexp1=. if anno==2010;
(7951 real changes made, 7951 to missing)

. gen Dexp2=mu_rf!=.;

.  replace Dexp2=. if anno==2010;
(7951 real changes made, 7951 to missing)

. /********** COMPUTE REALIZATIONS: R10(1+R09)+R9 **********/
> 
> gen RR  = FTSE2010/100   *(1+FTSE2009/100)   +FTSE2009/100;
(7951 missing values generated)

. gen Rbnd= gbnds2010/100  *(1+gbnds2009/100)  +gbnds2009/100;
(7951 missing values generated)

. gen Rrf = bankdep2010/100*(1+bankdep2009/100)+bankdep2009/100;
(7951 missing values generated)

. /*For realized housing returns, I take 2010 SHIW prov/com avg changes in valabit/supab (over previous 2 yrs)*/
> ren rH_prov rH_prov2;

.  lab var rH_prov2 "Avg biennial (2009, 2010) return on housing, by iprov";

. gen rH_prov=sqrt(rH_prov2+1)-1;
(7951 missing values generated)

. /******NOTA BENE che il rendimento e' il rendimento medio sul biennio/anno precedente!!!*/ 
> 
> gen RH = rH_prov*(1+rH_prov)+rH_prov;
(7951 missing values generated)

. /**********************************************************/
> 
> keep nq anno cn /*
> */ mu_H sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit risfin risf2 Daf3 /*
> */ p_prov p_prov2 p_com2-p_com4 p_A5* impacq* manstra anposs anposq Danposs piubagni /*
> */ hprices06 hpr_sq sport04 high_grw trib_inef va2 avgva rotaz x_cas /*
> */ lowcomp verored klima Dexp* /*
> */ mu_R FTSEm_l1-FTSEm_l6 x_bor FTSEmo* /*
> */ mu_rf bank_l1-bank_l6 x_int bankdep* /*
> */ mu_rbnd bonds_l1-bonds_l6 bonds* /*
> */ af af1-af3 ar ar1-ar3 R* sig*/*
> */ ncomp nperc np2 married employed pubblico self small Dpf;

. /**************** TABLE 2***********************/
> sum mu_rf mu_rbnd mu_R mu_H, det;

                            mu_rf
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0259017      -.0259017
 5%    -.0179751      -.0259017
10%    -.0179751      -.0259017       Obs                1202
25%    -.0018308      -.0259017       Sum of Wgt.        1202

50%     .0129933                      Mean           .0093449
                        Largest       Std. Dev.      .0154872
75%        .0173       .0528908
90%        .0273       .0528908       Variance       .0002399
95%     .0278021       .0528908       Skewness      -.4710329
99%     .0438311       .0622393       Kurtosis       3.068555

                           mu_rbnd
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0007983       .0007983
 5%     .0087249       .0007983
10%     .0087249       .0007983       Obs                1204
25%     .0248692       .0007983       Sum of Wgt.        1204

50%     .0396934                      Mean           .0359702
                        Largest       Std. Dev.      .0155619
75%         .044        .088553
90%         .054        .088553       Variance       .0002422
95%         .054        .088553       Skewness      -.3979846
99%     .0705311       .0889392       Kurtosis       3.236606

                            mu_R
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4035684      -.6971492
 5%     -.352751      -.6971492
10%     -.352751      -.6971492       Obs                1703
25%    -.1653109      -.6971492       Sum of Wgt.        1703

50%    -.0486381                      Mean           -.095854
                        Largest       Std. Dev.      .1346221
75%    -.0182067       .2653109
90%     .0133467       .2653109       Variance       .0181231
95%     .0616112       .2653109       Skewness      -1.191558
99%     .1430662       .2653109       Kurtosis       4.762299

                            mu_H
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1934677      -.2913079
 5%    -.0953981      -.2913079
10%    -.0325745      -.2913079       Obs                 965
25%      .011492      -.2653109       Sum of Wgt.         965

50%     .0430661                      Mean           .0958894
                        Largest       Std. Dev.      .1547525
75%     .1653109       .7533957
90%      .352751       .7533957       Variance       .0239483
95%      .352751       .7533957       Skewness         1.4127
99%     .6971492       .7533957       Kurtosis       5.760899

. sum sig_rf sig_rbnd sig_R sig_H, det;

                           sig_rf
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .001282        .000071
 5%      .002144        .000071
10%     .0026662        .000071       Obs                1225
25%      .007803        .000071       Sum of Wgt.        1225

50%     .0169989                      Mean           .0184213
                        Largest       Std. Dev.      .0173777
75%     .0275253       .0795789
90%     .0368931       .0809585       Variance        .000302
95%     .0407966       .1110124       Skewness       9.119148
99%     .0598331       .3989009       Kurtosis       190.0916

                          sig_rbnd
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0012798       .0004026
 5%     .0022189       .0004026
10%     .0026768       .0006188       Obs                1225
25%      .007803       .0006188       Sum of Wgt.        1225

50%     .0169989                      Mean           .0184897
                        Largest       Std. Dev.      .0173373
75%     .0275253       .0795789
90%     .0368931       .0809585       Variance       .0003006
95%     .0407966       .1110124       Skewness       9.176194
99%     .0598331       .3989009       Kurtosis       191.7186

                            sig_R
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0134134       .0005603
 5%     .0219145       .0005603
10%     .0237231       .0045502       Obs                1734
25%     .0266134       .0045502       Sum of Wgt.        1734

50%     .0972569                      Mean           .1331574
                        Largest       Std. Dev.       .121248
75%     .2273087       .8095854
90%     .2752531       .8095854       Variance       .0147011
95%     .3668393       .9448897       Skewness        1.56914
99%      .513315       .9448897       Kurtosis        7.24698

                            sig_H
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0045504       .0005606
 5%     .0177042       .0005606
10%     .0221049       .0005606       Obs                 971
25%     .0266136       .0045504       Sum of Wgt.         971

50%     .0972569                      Mean           .1354759
                        Largest       Std. Dev.      .1360961
75%     .2273087       .9383966
90%     .2752531       .9448897       Variance       .0185222
95%      .368931       .9448897       Skewness       2.949347
99%      .513315       1.689091       Kurtosis       24.39088

. /****************************************************************************************************/
> 
> 
> 
> 
> 
> /****************************************************************************************************/
> /******                                                                         For table3                         
>                                                      *****/
> /****************************************************************************************************/
> 
> #delimit cr
delimiter now cr
. /******FIT H*****/
.                         qui heckman mu_H sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit risfin risf2 Daf3 /*
>                         */ p_prov p_prov2 p_com2-p_com4 p_A5* impacq* manstra anposs anposq Danposs piubagni /*
>                         */ hprices06 hpr_sq sport04 high_grw trib_inef va2 avgva if rotaz==1 & x_cas==0, /*
>                         */ select(lowcomp verored klima Dexp sex sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc li
> t risfin risf2 Daf3 /*
>                         */ p_prov p_prov2 p_com2-p_com4 p_A5* impacq* manstra anposs anposq Danposs piubagni /*
>                         */ hprices06 hpr_sq sport04 high_grw trib_inef va2 avgva) nolog twostep 

. 
.                         predict mu_Hh_heck                      /*Valabit is missing for a handful of households*/
(option xb assumed; fitted values)

.                                                                                 /*1ST FITTED REGRESSOR*/
. 
.                         sort nq anno

.                         qui by nq: gen mu_H10=mu_H[_n+1]

.                         lab var mu_H10 "Expected return on housing in 2010 (for those in the panel)"

.                                 
. /******FIT FTSE*****/
.                         #delimit cr
delimiter now cr
.                         gen x1=FTSEm_l1
(7951 missing values generated)

.                         gen x2=FTSEm_l2
(7951 missing values generated)

.                         gen x3=FTSEm_l3
(7951 missing values generated)

.                         gen x4=FTSEm_l4
(7951 missing values generated)

.                         gen x5=FTSEm_l5
(7951 missing values generated)

.                         gen x6=FTSEm_l6
(7951 missing values generated)

. 
.                         qui heckman mu_R sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit risfin risf2 Daf3 /*
>                         */ FTSEm_l1 FTSEm_l2 FTSEm_l3 FTSEm_l4 FTSEm_l5 FTSEm_l6 hprices06 hpr_ sport04 /*
>                         */ trib_inef high_grw va2 avgva if x_bor==0, /*
>                         */ select(lowcomp verored klima Dexp2 sex yrsedu whiteco eta A52-A55 com2-com4 lit Dnperc r
> isfin risf2/*
>                         */ Daf3 FTSEm_l1 FTSEm_l2 FTSEm_l3 FTSEm_l4 FTSEm_l5 FTSEm_l6 hprices06 hpr_ sport04 /*
>                         */ trib_inef high_grw va2 avgva) nolog twostep

. 
.                         replace FTSEm_l1=FTSEmo12
(6402 real changes made)

.                         replace FTSEm_l2=FTSEmo11
(6402 real changes made)

.                         replace FTSEm_l3=FTSEmo10 
(6402 real changes made)

.                         replace FTSEm_l4=FTSEmo9
(6402 real changes made)

.                         replace FTSEm_l5=FTSEmo8
(6402 real changes made)

.                         replace FTSEm_l6=FTSEmo7
(6402 real changes made)

.                         predict mu_Rh_heck if x_bor==0  /*2ND FITTED REGRESSOR*/
(option xb assumed; fitted values)
(8462 missing values generated)

. 
.                         replace FTSEm_l1=x1
(6402 real changes made)

.                         replace FTSEm_l2=x2
(6402 real changes made)

.                         replace FTSEm_l3=x3 
(6402 real changes made)

.                         replace FTSEm_l4=x4
(6402 real changes made)

.                         replace FTSEm_l5=x5
(6402 real changes made)

.                         replace FTSEm_l6=x6
(6402 real changes made)

.                         drop x1-x6

. 
. /******FIT Bank deposits*****/
.                         gen x1=bank_l1
(7951 missing values generated)

.                         gen x2=bank_l2
(7951 missing values generated)

.                         gen x3=bank_l3
(7951 missing values generated)

.                         gen x4=bank_l4
(7951 missing values generated)

.                         gen x5=bank_l5
(7951 missing values generated)

.                         gen x6=bank_l6
(7951 missing values generated)

. 
.                         qui heckman mu_rf sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit risfin risf2 Daf3 /*
>                         */ bank_l1 bank_l2 bank_l3 bank_l4 bank_l5 bank_l6 hprices06 hpr_ sport04 /*
>                         */ trib_inef high_grw va2 avgva if x_int==0, /*
>                         */ select(lowcomp verored klima Dexp1 sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit r
> isfin risf2/*
>                         */ Daf3 bank_l1 bank_l2 bank_l3 bank_l4 bank_l5 bank_l6 hprices06 hpr_ sport04 /*
>                         */ trib_inef high_grw va2 avgva) nolog twostep

. 
.                         replace bank_l1=bankdep12
(6402 real changes made)

.                         replace bank_l2=bankdep11
(6402 real changes made)

.                         replace bank_l3=bankdep10 
(6402 real changes made)

.                         replace bank_l4=bankdep9
(6402 real changes made)

.                         replace bank_l5=bankdep8
(6402 real changes made)

.                         replace bank_l6=bankdep7
(5574 real changes made)

.                         predict mu_rfh_heck if x_int==0         /*3RD FITTED REGRESSOR*/
(option xb assumed; fitted values)
(9131 missing values generated)

. 
.                         replace bank_l1=x1
(6402 real changes made)

.                         replace bank_l2=x2
(6402 real changes made)

.                         replace bank_l3=x3 
(6402 real changes made)

.                         replace bank_l4=x4
(6402 real changes made)

.                         replace bank_l5=x5
(6402 real changes made)

.                         replace bank_l6=x6
(5574 real changes made)

.                         drop x1-x6

.                         
. /******FIT Government bonds*****/
.                         gen x1=bonds_l1

.                         gen x2=bonds_l2

.                         gen x3=bonds_l3

.                         gen x4=bonds_l4

.                         gen x5=bonds_l5

.                         gen x6=bonds_l6

. 
.                         qui heckman mu_rbnd sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit risfin risf2 Daf3 /
> *
>                         */ bonds_l1 bonds_l2 bonds_l3 bonds_l4 bonds_l5 bonds_l6 hprices06 hpr_ sport04 /*
>                         */ trib_inef high_grw va2 avgva if x_int==0, /*
>                         */ select(lowcomp verored klima Dexp1 sex yrsedu whiteco eta A52-A55 com2-com4 Dnperc lit r
> isfin risf2/*
>                         */ Daf3 bonds_l1 bonds_l2 bonds_l3 bonds_l4 bonds_l5 bonds_l6 hprices06 hpr_ sport04 /*
>                         */ trib_inef high_grw va2 avgva) nolog twostep

. 
.                         replace bonds_l1=bonds12
(14353 real changes made)

.                         replace bonds_l2=bonds11
(14353 real changes made)

.                         replace bonds_l3=bonds10 
(14353 real changes made)

.                         replace bonds_l4=bonds9
(14353 real changes made)

.                         replace bonds_l5=bonds8
(14353 real changes made)

.                         replace bonds_l6=bonds7
(14353 real changes made)

.                         predict mu_rbndh_heck if x_int==0       /*4TH FITTED REGRESSOR*/
(option xb assumed; fitted values)
(9131 missing values generated)

. 
.                         replace bonds_l1=x1
(14353 real changes made)

.                         replace bonds_l2=x2
(14353 real changes made)

.                         replace bonds_l3=x3 
(14353 real changes made)

.                         replace bonds_l4=x4
(14353 real changes made)

.                         replace bonds_l5=x5
(14353 real changes made)

.                         replace bonds_l6=x6
(14353 real changes made)

.                         drop x1-x6

.                         
. /**************************************************************************************/
. /********** COMPUTE (1+rho)E08(R09) (expectation)**********/
. 
.                         #delimit;
delimiter now ;
.                         gen exp_R  =(1+0.4558194)*mu_R;
(14225 missing values generated)

.                         gen exp_Rhk=(1+0.4558194)*mu_Rh_heck;
(8462 missing values generated)

.                         gen exp_bnd  =(1+0.7531304)*mu_rbnd;
(14724 missing values generated)

.                         gen exp_bndhk=(1+0.7531304)*mu_rbndh_heck;
(9131 missing values generated)

.                         gen exp_rf  =(1+0.739289)*mu_rf;
(14726 missing values generated)

.                         gen exp_rfhk=(1+0.739289)*mu_rfh_heck;
(9131 missing values generated)

.                         gen exp_Hhk=2*mu_Hh_heck;

. /********NOW CONSTRUCT the regressors**********************/
> /*... unexpected shocks...*/
>                         gen unexp_af1  =af1*(Rrf-exp_rf);
(14726 missing values generated)

.                         gen unexp_af1hk=af1*(Rrf-exp_rfhk);
(9131 missing values generated)

.                         gen unexp_af2  =af2*(Rbnd-exp_bnd);
(14724 missing values generated)

.                 /*Many zeros for non-holders!*/
>                         gen unexp_af2hk=af2*(Rbnd-exp_bndhk);
(9131 missing values generated)

.                         gen unexp_af3  =af3*(RR-exp_R);
(14225 missing values generated)

.                         gen unexp_af3hk=af3*(RR-exp_Rhk);
(8462 missing values generated)

.                         gen unexp_ar1hk=ar1*(RH-exp_Hhk);
(7951 missing values generated)

.                         gen unexp_ar2  =ar2*(RR-exp_R);
(14225 missing values generated)

.                         gen unexp_ar2hk=ar2*(RR-exp_Rhk);
(8462 missing values generated)

.                         gen unexp_af  =unexp_af1+unexp_af2+unexp_af3;
(15193 missing values generated)

.                         gen unexp_ar  =unexp_ar1hk+unexp_ar2;
(14225 missing values generated)

.                         gen unexp_afar=unexp_af+unexp_ar;
(15193 missing values generated)

.                         gen unexp_afhk=unexp_af1hk+unexp_af2hk+unexp_af3hk;
(9425 missing values generated)

.                         gen unexp_arhk=unexp_ar1hk+unexp_ar2hk;
(8462 missing values generated)

.                         gen unexp_afarhk=unexp_afhk+unexp_arhk;
(9425 missing values generated)

.                         /* ... and anticipated changes */
>                         gen exp_af1  =af1*exp_rf;
(14726 missing values generated)

.                         gen exp_af1hk=af1*exp_rfhk;
(9131 missing values generated)

.                         gen exp_af2  =af2*exp_bnd;
(14724 missing values generated)

.                         gen exp_af2hk=af2*exp_bndhk;
(9131 missing values generated)

.                         gen exp_af3  =af3*exp_R;
(14225 missing values generated)

.                         gen exp_af3hk=af3*exp_Rhk;
(8462 missing values generated)

.                         gen exp_ar1hk=ar1*exp_Hhk;

.                         gen exp_ar2  =ar2*exp_R;
(14225 missing values generated)

.                         gen exp_ar2hk=ar2*exp_Rhk;
(8462 missing values generated)

.                         gen exp_af  =exp_af1+exp_af2+exp_af3;
(15193 missing values generated)

.                         gen exp_ar  =exp_ar1hk+exp_ar2;
(14225 missing values generated)

.                         gen exp_afar=exp_af+exp_ar;
(15193 missing values generated)

.                         gen exp_afhk=exp_af1hk+exp_af2hk+exp_af3hk;
(9425 missing values generated)

.                         gen exp_arhk=exp_ar1hk+exp_ar2hk;
(8462 missing values generated)

.                         gen exp_afarhk=exp_afhk+exp_arhk;
(9425 missing values generated)

.                         gen afar=af+ar;

.                         /*2008-2010 panel*/
>                         drop if (eta<20 | eta>80) & anno==2008;
(663 observations deleted)

.                         sort nq anno;

.  qui by nq: gen N=_N;

.  keep if N==2;
(6713 observations deleted)

.  drop N;

.                         sort nq anno;

.                         qui by nq: gen delta_cn=(cn[_n+1]-cn)/1000;

.                         qui by nq: gen cngrw =(cn[_n+1]-cn)/cn;

.                         drop if cngrw<-0.5 | (cngrw>2 & cngrw!=.);
(59 observations deleted)

.  drop cngrw;

.                                                 sort nq anno;

.  qui by nq: gen N=_N;

.  keep if N==2;
(59 observations deleted)

.  drop N;

. /****************TABLE 3***********************/
> /*Estimation sample*/
> sum mu_rfh_heck mu_rbndh_heck mu_Rh_heck mu_Hh_heck if  afar>0 & mu_R!=. & mu_rf!=. & afar<2000;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
 mu_rfh_heck |       410     .006659    .0048116  -.0037397   .0241524
mu_rbndh_h~k |       410    .0329492    .0048131   .0223535   .0500017
  mu_Rh_heck |       410   -.1344856     .048734  -.2433251  -.0107461
  mu_Hh_heck |       410    .1151643     .056981  -.0389412   .3156524

. /*Whole sample*/
> sum mu_rfh_heck mu_rbndh_heck mu_Rh_heck mu_Hh_heck if  afar>0 & ar<1000 & af3<100 &  exp_afhk!=.;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
 mu_rfh_heck |      3180    .0073516    .0042139  -.0055696   .0212469
mu_rbndh_h~k |      3180    .0336663    .0042105   .0204397   .0478285
  mu_Rh_heck |      3180   -.1544025     .045461  -.2832831  -.0107461
  mu_Hh_heck |      3180    .1037707    .0644084  -.0949631   .4142324

. clear all;

. log c;
      name:  <unnamed>
       log:  C:\Data\Expect\WE\Revision_final\ForPublication\tables_1_2_3.log
  log type:  text
 closed on:  29 Apr 2016, 11:30:13
---------------------------------------------------------------------------------------------------------------------
